Revit 2027 API
PanelTypeSet.Erase Method
Removes a specified panel type from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	PanelType item
)
Public Overridable Function Erase (
	item As PanelType
) As Integer
public:
virtual int Erase(
	PanelType^ item
)
abstract Erase :
        item : PanelType -> int
override Erase :
        item : PanelType -> int
Parameters
item PanelType
The panel type to be erased.
Return Value
Int32
The number of panel types that were erased from the set.
See Also
Reference
PanelTypeSet Class
Autodesk.Revit.DB Namespace